Revit 2024 API
ExternalServices.BuiltInExternalServices.PipeFrictionFactorService Property
 Pipe friction factor service id
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalServiceId PipeFrictionFactorService { get; }
Visual Basic
Public Shared ReadOnly Property PipeFrictionFactorService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ PipeFrictionFactorService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace